{
  "blogs": [
    {
      "id": "9d34",
      "category": "Technology",
      "title": "How Bengaluru Police cracked the ATM van heist after a 54-hour chase",
      "blogger_name": "HT News Desk",
      "image": "https://www.hindustantimes.com/ht-img/img/2025/11/22/550x309/PTI11-22-2025-000272B-0_1763810996244_1763811006834.jpg",
      "description": "On November 19, a group of unidentified men posing as RBI officials intercepted an ATM cash van in Bengaluru and fled with nearly ₹7 crore, a robbery that police say may be the city’s biggest so far.\n\nThe heist took place while a CMS Info Systems vehicle was carrying cash from a private bank branch in JP Nagar. The gang arrived in a car bearing a Government of India sticker, stopped the van on the pretext of verifying documents, and then forced the staff and the cash into their own vehicle.\n\nThe employees were later dropped near Dairy Circle, while the robbers escaped with the money.Teams fanned out across Karnataka, Kerala, Tamil Nadu, Andhra Pradesh and Telangana, with some even tracking leads up to Goa.\n\nOver 30 people were questioned as investigators pieced together technical clues, field intelligence, CCTV footage and vehicle movement data.\n\nThe effort paid off quickly. Within the first 24 hours, police had identified the suspects and the vehicles involved. The three accused were detained within 54 hours, and ₹5.76 crore of the stolen money was recovered in the next six hours.\n\nOne of the getaway vehicles was also traced and seized. Police believe the gang consisted of six to eight people who jointly planned and executed the robbery, including managing the distribution and movement of the stolen cash afterwards.\nThose arrested include a constable from the Govindarajanagar police station, a former employee of CMS Infosystems, and the in-charge of the cash refill vehicle.\n\nInvestigators had begun to suspect an insider role on Friday, after mobile tower data from the robbery site revealed repeated calls between the constable and the former CMS employee during the heist.\n\nTheir call records showed frequent communication in the days leading up to the robbery as well. The ex-employee had recently resigned and had become closely acquainted with the constable, officers said."
    },
    {
      "id": "8099",
      "category": "Science",
      "title": "Meet 5 scientists reshaping the way we understand the world",
      "blogger_name": "Science News Staff",
      "image": "https://i0.wp.com/www.sciencenews.org/wp-content/uploads/2025/11/2025SNToWatch_feat.jpg?w=1440&ssl=1",
      "description": "New scientific findings come out every day. Often, people only learn about the researchers behind some of these discoveries years or decades later when they win a Nobel Prize. We think you should know about them much sooner.\n\nThis year, Science News is highlighting five early- and mid-career scientists as part of our Scientists to Watch series. Some are working to solve big societal challenges while others aim to expand our knowledge of the world. Below, you’ll meet scientists who are unraveling the mysteries of black holes, investigating the geology of icy moons, tying childhood experiences to mental health, studying diseases that disproportionately affect women of color and assessing the impact of climate change on the Arctic.\n\nFor the first time, you can also watch interviews with the scientists. We hope you’ll be inspired by their passion for using science to answer big questions. As always, please send nominations for next year’s Scientists to Watch to S2W@sciencenews.org. — Karen Kwon, Research and Special Projects Editor"
    },
    {
      "id": "6d75",
      "category": "Sports",
      "title": "First Ashes Test: Travis Head’s 69-ball century powers Australia to victory against England",
      "blogger_name": "The Hindu",
      "image": "https://th-i.thgim.com/public/incoming/2hbw5q/article70310951.ece/alternates/LANDSCAPE_1200/Australia_England_Cricket_44393.jpg",
      "description": "The tourists were cruising at 65-1 and building an ominous second-innings lead, but Boland and Starc left them reeling with four wickets in as many overs.\n\nA ruthless Boland accounted for Ben Duckett (28), Ollie Pope (33) and Harry Brook (0) in the space of 11 balls, then two deliveries later Starc sent Joe Root packing for eight.\n\nWhen Starc removed skipper Ben Stokes (2), England were flailing at 88-6 and the veteran paceman had bagged a 10-wicket haul for only the third time after his first innings 7-58, a career-best.\n\nEngland were partially rescued by a crucial 50-run stand between Gus Atkinson (37) and Brydon Carse (20) before being rolled for 164 at tea.\n\nWhen they returned Usman Khawaja again failed to show as opener as he battles back stiffness, with Australia signalling their intent by sending in Head.\n\nHead, who has opened nine times previously in Test cricket, quickly got into his destructive rhythm, crunching some lovely boundaries including big sixes off Carse and Mark Wood."
    },
    {
      "id": "1661",
      "category": "Entertainment",
      "title": "Unwell Saroj Khan choreographed Devdas’ Dola Re while lying on the floor, won 17 awards for Aishwarya Rai-Madhuri Dixit song",
      "blogger_name": "The Indian Express",
      "image": "https://images.indianexpress.com/2025/11/saroj-khan-dola-re.jpg?w=640",
      "description": "India is one of the largest film producers in the world, and while it may not always churn out top quality, the Indian film industry certainly makes up for it by offering the world something that no one else seems to have – choreographed dance numbers in the middle of the movie. Something that might appear alien to European or American audiences, is an intrinsic part of Indian films. Every era of Hindi films has a distinct song and dance style and for those who grew up in the 1990s, this era was defined by the choreographed songs of Saroj Khan.\n\nComposed by Ismail Darbar, with lyrics by Nursat Badr, the vocals here were done by Shreya Ghoshal and Kavita Krishnamurthy. Such was the impact of the song that the sarees and jewellery worn by the actors, Madhuri Dixit and Aishwarya Rai, became a part of mainstream fashion, and 21 years later, Karan Johar paid tribute to the song in his film Rocky Aur Rani Ki Prem Kahani.\n\nDevdas was an ambitious project for director Sanjay Leela Bhansali, and he left no stone unturned in getting every element of the film just right. Reportedly made on a budget of Rs 50 crore, the making of Devdas was an arduous process, and so was the making of the song “Dola Re Dola”. Calling it the “toughest” song of her career, Saroj Khan once said that she saw it as a “feather in my cap.” This was also the song that had to deliver on the biggest promise of the film – the dance-off between Madhuri and Aishwarya. Both top actresses, and the best dancers of their generation, this music video had people comparing them throughout to see who would come out on top. Saroj was well aware of this and on top of that, she also had to make sure that both actresses had enough to perform, so it wouldn’t look like one was given preference over the other."
    },
    {
      "id": "ef3d",
      "category": "Health",
      "title": "Washington State man believed to be first to die from rare strain of H5N5 bird flu in U.S.",
      "blogger_name": "The Hindu",
      "image": "https://th-i.thgim.com/public/incoming/z45yqa/article70310399.ece/alternates/LANDSCAPE_1200/2024-05-30T174947Z_338548687_RC21BZ9PHJYB_RTRMADP_3_HEALTH-BIRDFLU-TESTING.jpg",
      "description": "Earlier this month, the Centers for Disease Control and Prevention issued a statement about the infection that said no information would suggest “the risk to public health has increased as a result of this case”.\n\nH5N5 is not believed to be a greater threat to human health than the H5N1 virus behind a wave of 70 reported human infections in the U.S. in 2024 and 2025. Most of those have been mild illnesses in workers on dairy and poultry farms.\n\nThe distinction between H5N5 and H5N1 lies in a protein involved in releasing the virus from an infected cell and promoting spread to surrounding cells.\n\n“The man from Grays Harbor County, about 125 km Southwest of Seattle, had a backyard flock of domestic poultry that had been exposed to wild birds,” health officials said.\n\nThe man, an older adult with underlying health conditions, was being treated for a bird flu called H5N5 after becoming seemingly the first known human infected by the strain, according to a statement from the Washington State Department of Health on Friday"
    },
    {
      "id": "cf01",
      "category": "Business",
      "title": "U.S. FDA issues seven observations to Natco Pharma’s Chennai plant",
      "blogger_name": "The Hindu Bureau",
      "image": "https://th-i.thgim.com/public/incoming/vgt0fr/article70310569.ece/alternates/LANDSCAPE_1200/IMG_BL10_Natco_new_2_1_D2CL9QM9.jpg",
      "description": "Natco Pharma’s active pharmaceutical ingredients unit in Chennai has received seven observations from the U.S. Food and Drug Administration.\n\nThe U.S. FDA had conducted an inspection at the API manufacturing plant in Manali, Chennai, from November 17-21. On conclusion, of the inspection, the company received seven observations in the Form-483, the generic drugmaker said on Friday (November 21, 2025).\n\nThe company believes the observations are procedural in nature and is confident to address them comprehensively, Natco Pharma said, reaffirming commitment to being cGMP compliant and supplying high-quality products."
    },
    {
      "id": "dc0e",
      "category": "Business",
      "title": "Sensex falls by 400 points on weak global trends, waning rate cut hopes; snaps 2-day rally Maruti, Mahindra & Mahindra, Tata Motors Passenger Vehicles and ITC were among the gainers",
      "blogger_name": "The Hindu",
      "image": "https://th-i.thgim.com/public/incoming/accxgg/article70307366.ece/alternates/LANDSCAPE_1200/2025-11-07T065921Z_1148292179_RC2USDAMZK08_RTRMADP_3_INDIA-STOCKS-FLOWS.JPG",
      "description": "Snapping the two-day rally, benchmark indices Sensex and Nifty closed lower on Friday (November 21, 2025) mainly due to weak global trends and fading hopes of a rate cut by the U.S. Federal Reserve in December.\nSnapping the two-day rally, benchmark indices Sensex and Nifty closed lower on Friday (November 21, 2025) mainly due to weak global trends and fading hopes of a rate cut by the U.S. Federal Reserve in December.\n\nSnapping the two-day rally, benchmark indices Sensex and Nifty closed lower on Friday (November 21, 2025) mainly due to weak global trends and fading hopes of a rate cut by the U.S. Federal Reserve in December."
    }
  ]
}